tutorials/combustion/buoyantReactingFoam/Lagrangian/rivuletPanel/system/wallFilmRegion/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/wallFilmRegion";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phid,alpha) Gauss upwind;
    div(phi,U)      Gauss upwind;
    div(phi,e)      Gauss upwind;

    div(nHat)       Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
